import React from 'react';
import { SafeAreaView, Text, View, StyleSheet,ScrollView  } from 'react-native';

export default function Tip_2_Screen({navigation}) {
    return (
        <SafeAreaView style={styles.box}>
        <ScrollView>

            <Text style={styles.toppic}>7 วิธี ที่จะทำให้คุณเลิกเป็นคนฟุ้งซ่าน คิดมาก ขี้กังวล</Text>
            <Text style={styles.content}>   แน่นอนว่าตัวคุณเองรู้อยู่แล้ว ว่าการใช้เวลาเป็นชั่วโมงเพื่อตัดสินใจว่าจะเลือกกินอะไรดีในมื้อเที่ยงของวันนี้เป็นเรื่องไร้เหตุผล เช่นเดียวกับการใช้เวลานับสัปดาห์เพื่อตัดสินใจว่าจะรับข้อเสนองานชิ้นนี้ดีไหม? หรือใช้เวลาเป็นปีเพื่อคิดว่าจะแต่งงานกับแฟนคนนี้ดีรึเปล่า?
คุณอาจจะคิดว่า “พอได้แล้วน่า…ตัดสินใจซะทีเถอะ” แต่พอผ่านไปแค่ไม่กี่นาที ความลังเลและความหวั่นวิตกก็เริ่มจู่โจมเข้ามาเรื่อย ๆ แม้คุณจะพยายามสร้างภูมิคุ้มกันกับความรู้สึกเหล่านี้บ้างแล้วก็ตาม
ทุกคนคงเคยผ่านสถานการณ์แบบนี้มาแล้ว และมีวิธีรับมือที่ต่างกันออกไป โดยเว็บไซต์ Quora ได้มีคนไปตั้งคำถามว่า “ฉันควรแก้นิสัยคิดมากนี้ยังไงดี?” ซึ่งก็มีผู้คนมากมายที่มาแชร์วิธีของตัวเอง พร้อมกับร่วมโหวตคำตอบที่สร้างสรรค์ที่สุด และสามารถสรุปได้เป็น 7 วิธีหลัก ๆ ที่จะช่วยให้คุณเลิกเป็นคนคิดมาก ฟุ้งซ่าน และขี้กังวลได้ดังนี้
            </Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:"เคยเป็นบ้างไหมละ เจ้ามนุษย์ ไปลองอ่านกันเลย"</Text>
            <Text></Text>
            
            <Text style={styles.h1}>1. สังเกตความคิดของตัวเอง</Text>
            <Text style={styles.content}>   ส่วนสำคัญที่สุดของการทำสมาธิคือ การปล่อยให้ความคิดของคุณลอยผ่านไป แทนที่จะไปยึดติดอยู่กับมันหรือพยายามที่จะหยุดคิดมัน
การฝึกสมาธิแบบเจริญสติ (Mindfulness Meditation) เป็นสิ่งที่ช่วยให้คุณ หยุดหมกมุ่นกับเรื่องในอดีตได้ โดยให้คุณลองสังเกตการณ์ความคิดของตัวเอง แทนที่จะลงไปหมกมุ่นอยู่กับมัน
สตีฟ จอบส์ เองก็เคยอธิบายเกี่ยวกับวิธีการเช่นเดียวกันนี้ให้ วอลเตอร์ ไอแซ็กซัน ผู้เขียนชีวประวัติของเขาฟัง ดังนี้
“ลองนั่งอยู่เฉย ๆ แล้วสังเกตความคิดของตัวเองดู คุณจะรู้เลยว่าความคิดมันไร้ขอบเขตจริง ๆ และเวลาที่คุณพยายามทำให้มันนิ่ง ก็มีแต่จะแย่ลงเท่านั้น แต่จิตใจของคุณจะสงบลงเองเมื่อเวลาผ่านไปสักพัก และเมื่อจิตใจของคุณสงบแล้วมันก็จะมีที่ว่างในการรับฟังสิ่งที่ละเอียดอ่อนยิ่งขึ้น”
            </Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:"ถ้าทำแล้วจะหยุดคิดถึงหมูปิ้งไหมน้า ~~"</Text>
            <Text></Text>
            <Text style={styles.h1}>2. เขียนความคิดของตัวเองลงไป</Text>
            <Text style={styles.content}>   อีกวิธีนึง ที่จะช่วยหยุดความคิดฟุ้งซ่านของคุณ ก็คือ การระบายให้กับคนที่มีมุมมองวิธีคิดแตกต่างไปจากคุณได้ฟัง หรือจะใช้วิธีเขียนระบายความคิดของตัวลงไปในกระดาษแทนก็ได้ เพราะการเขียนทำให้เราคิดอย่างเป็นระบบขึ้นมาก ถ้าคุณเก็บความคิดเหล่านั้นไว้แต่ในหัว นอกจากมันจะไปสุมกันจนเป็นภูเขาเลากา มันยังทำให้คุณวนกลับมาคิดเรื่องเดิมซ้ำอยู่อย่างนั้นไม่จบสิ้น</Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:"ดังที่ว่า เก็บไว้มากก็ไม่ดี ระบายออกมาบ้าง ,แต่ชั้นไม่ได้หมายถึงเงินในกระเป๋าเธอหรอกนะ เจ้ามนุษย์"</Text>
            <Text></Text>
            <Text style={styles.h1}>3. กำหนดช่วงเวลาสำหรับ “การหยุดใช้ความคิด”</Text>
            <Text style={styles.content}>   การกำหนดโซน “หยุดใช้ความคิด” ช่วยห้ามไม่ให้คุณหมกมุ่นกับปัญหาอย่างใดอย่างหนึ่งมากเกินไป เช่น การไม่คิดเกี่ยวกับเรื่องยาก ๆ หลังเวลาสองทุ่มเพื่อไม่ให้มันมารบกวนเวลานอนหลับ
Amy Morin ซึ่งเป็นทั้งนักสังคมสงเคราะห์และนักเขียน ได้แนะนำวิธีที่ใกล้เคียงกันไว้ในคอลัมน์หนึ่งของ Psychology Today ว่าให้แบ่งเวลาไว้ประมาณ 20 นาทีต่อวัน สำหรับการสะท้อนความคิดของตัวเอง
“ภายในยี่สิบนาทีนี้ ปล่อยให้ตัวเองวิตกกังวล ครุ่นคิด ฟุ้งซ่านได้เต็มที่ตามต้องการ แล้วพอหมดเวลา ก็ให้เปลี่ยนไปทำสิ่งอื่นที่มีประโยชน์กว่า ถ้าคุณเริ่มคิดมากนอกช่วงเวลาที่กำหนดไว้เมื่อไหร่ ก็ให้เตือนตัวเองว่า ค่อยเอาเก็บไปคิดในช่วงเวลาที่กำหนดดีกว่า”
            </Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:"ลองไปใช้ดูกันได้นะ เจ้ามนุษย์"</Text>
            <Text></Text>
            <Text style={styles.h1}>4. เบี่ยงเบนความคิดของตัวเอง</Text>
            <Text style={styles.content}>   ฟังดูง่าย ๆ แต่ที่จริงการจดจ่อกับสองสิ่งไปพร้อมกันนี่มันยากนะ ลองออกกำลังกายหรือเล่นเกมดูเมื่อรู้ตัวว่าตนเองกำลังคิดมาก เพื่อสร้างสมดุลระหว่างอารมณ์และร่างกาย
ผู้เชี่ยวชาญหลายคนก็เห็นด้วยกับวิธีนี้ Stepher S. Ilardi ผู้เขียนหนังสือเรื่อง The Depression Cure กล่าวกับ Fox News ว่า วิธีแก้การคิดมากคือ ให้หากิจกรรมที่เบี่ยงเบนความสนใจของคุณ ซึ่งควรเป็น “กิจกรรมที่ใช้ทั้งร่างกาย ความคิด และการร่วมเล่นกับผู้อื่น เช่น เทนนิส หรือการเดินเที่ยวกับเพื่อนสักคน”
            </Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:"ออกกำลังกายนะดีเสมอ รู้ไว้นะ เจ้ามนุษย์ 55555"</Text>
            <Text></Text>
            <Text style={styles.h1}>5. โฟกัสที่สิ่งที่ทำได้ในปัจจุบัน</Text>
            <Text style={styles.content}>   อีกหนึ่งวิธีแก้นิสัยคิดมากก็คือ เลิกคิดแล้วลงมือทำ อย่าไปโฟกัสในสิ่งที่คุณต้องทำ สิ่งที่ยังไม่ได้ทำ หรือแม้แต่สิ่งที่เกิดขึ้นรอบตัว แต่ให้พุ่งความสนใจไปในที่สิ่งที่สามารถทำได้ในปัจจุบันก็พอ ไม่ว่าจะใหญ่หรือเล็กแค่ไหนก็ตาม แล้วก็ลงมือทำมันซะ
Bob Migliani ผู้เขียนหนังสือเรื่อง Embrace of the Chaos เขียนลงในหนังสือพิมพ์ The Huffington Post ว่า เขามักจะเปลี่ยนความกังวลใจเกี่ยวกับอนาคตให้กลายเป็นการกระทำที่จับต้องได้ “ทุกครั้งที่ผมเริ่มกังวลในเรื่องที่ยังมาไม่ถึง ผมจะลุกจากที่ที่นั่งอยู่ เดินไปที่คอมพิวเตอร์และลงมือเขียนหนังสือของผมต่อ” เขากล่าว
</Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:" Just Do It , เคยได้ยินบ้างไหมละ เจ้ามนุษย์ 55555"</Text>
            <Text></Text>
            <Text style={styles.h1}>6. เคารพความคิดเห็นของตัวเอง</Text>
            <Text style={styles.content}>   เหตุที่คุณยังคงคิดมากจนไม่ยอมตัดสินใจ ส่วนหนึ่งอาจเป็นเพราะคุณไม่เชื่อว่าตัวเองจะตัดสินใจเลือกสิ่งที่ถูกต้อง จงเรียนรู้ที่จะเคารพความคิดเห็นของตัวเอง ยิ่งคิดมากเท่าไหร่ คุณก็จะยิ่งลังเลในความคิดของตัวเองมากเท่านั้น</Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:" ถึงนายจะไม่เชื่อ แต่เราเชื่อใจนายเสมอนะ คู่หู (แต่อย่าลืมให้อาหารชั้นด้วยละ) "</Text>
            <Text></Text>
            <Text style={styles.h1}>7. คุณสามารถเปลี่ยนแปลงการตัดสินใจที่ผิดพลาดได้</Text>
            <Text style={styles.content}>   เป็นเรื่องปกติที่จะกังวลว่าคุณเลือกงานผิด แต่งงานกับคนที่ไม่ใช่สำหรับตัวเอง หรือแม้แต่ขับรถกลับบ้านผิดทาง แต่ความผิดพลาดก็ไม่ได้นำไปสู่หายนะเสมอไป แถมยังเป็นโอกาสให้ได้เรียนรู้และเติบโตขึ้นด้วย
นักข่าวชื่อดัง Kathryn Schulz เคยขึ้นไปพูดบนเวที TED Talk เธอกล่าวว่า
“การตระหนักได้ว่าตัวเองทำอะไรพลาด แล้วปรับมุมมองการมองโลกใหม่ได้ จะเป็นจุดเริ่มต้นของความคิดสร้างสรรค์และนวัตกรรมใหม่ๆ”
“การคิดมากมักเป็นเพราะคุณคิดว่ามันเป็นการตัดสินใจครั้งสุดท้ายของคุณ เปลี่ยนแปลงไม่ได้และต้องถูกต้องเท่านั้น ซึ่งจริงๆ แล้ว คุณไม่ต้องกังวลกับความผิดพลาดเลย และให้เข้าใจไว้ว่าความคิดเห็นหรือความรู้ของคุณนั้นมันเปลี่ยนแปลงได้เสมอตามกาลเวลา แล้วคุณจะรู้สึกสงบและเป็นอิสระจากภายในอย่างแท้จริง”
            </Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:" หลายอย่างพลาดแล้วแก้ไขได้ แต่ที่ห้ามพลาด คือ !!อย่าลืมให้อาหารชั้นด้วยละ!! เข้าใจไหม เจ้ามนุษย์ "</Text>
            <Text></Text>
            
            <Text style={styles.phrase}>  OVERTHINKING KILLS YOUR HAPPINESS.</Text>
            <Text></Text>
            <Text style={styles.pet}>สัตว์เลี้ยง:" อย่าให้การคิดมาก มาผากความสุข(ของสองเรา) , 5555 "</Text>
            <Text></Text>
            <View style={styles.creditBox}>
                <Text style={styles.credit}>Credit: https://sumrej.com/how-to-stop-over-thinking-9-2016/</Text>
            </View>
        </ScrollView>
    </SafeAreaView>
    );
}


const styles = StyleSheet.create({
    toppic: {
        fontSize: 24,
        fontWeight:'bold', 
    },
    box: {
        backgroundColor: 'white',
        margin: 2,
        maxWidth: '97%',
        alignSelf: 'center',
        padding: 12,
    },
    content: {
        fontSize: 14,
        color: 'gray',
        padding: 8,
    },
    h1: {
        fontSize: 18,
        fontWeight:'bold',           
    },
    creditBox:{
        
    },
    credit: {
        fontSize: 14,
        color: 'blue',  
    },
    pet: {
        fontSize: 14,
        color: 'green',
        paddingLeft:8,
    },
    phrase:{
        fontSize: 18,
        fontWeight:'bold',
        color: 'darkorange',
    }
  });